In [ ]:
import numpy as np 
import pandas as pd

In [ ]:
Utility	Functions
Extract Column Names	df.columns
Select first 2 rows	df.iloc[:2]
Select first 2 columns	df.iloc[:,:2]
Select columns by name	df.loc[:,["col1","col2"]]
Select random no. of rows	df.sample(n = 10)
Select fraction of random rows	df.sample(frac = 0.2)
Rename the variables	df.rename( )
Selecting a column as index	df.set_index( )
Removing rows or columns	df.drop( )
Sorting values	df.sort_values( )
Grouping variables	df.groupby( )
Filtering	df.query( )
Finding the missing values	df.isnull( )
Dropping the missing values	df.dropna( )
Removing the duplicates	df.drop_duplicates( )
Creating dummies	pd.get_dummies( )
Ranking	df.rank( )
Cumulative sum	df.cumsum( )
Quantiles	df.quantile( )
Selecting numeric variables	df.select_dtypes( )
Concatenating two dataframes	pd.concat()
Merging on basis of common variable	pd.merge( )

In [ ]:
#Pandas Data Structure,Pandas has two types of data structures. These are series and dataframe.
#Pandas-Series
mySeries = pd.Series([3,-5,7,4], index=['a','b','c','d'])
type(mySeries)

pandas.core.series.Series

In [ ]:
#DataFrame
#The dataframe is a two-dimensional data structure. It contains columns.
data = {'Country' : ['Belgium', 'India', 'Brazil' ],
        'Capital': ['Brussels', 'New Delhi', 'Brassilia'],
        'Population': [1234,1234,1234]}
datas = pd.DataFrame(data, columns=['Country','Capital','Population'])
print(type(data))
print(type(datas))

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
#Import Data
#df = pd.read_csv('DJIA_table.csv')# import csv files
#pd.read_excel('filename') # import excel files
#pd.to_excel('dir/dataFrame.xlsx', sheet_name='Sheet1')
#Others(json, SQL, table, html)
# pd.read_sql(query,connection_object) -> Reads from a SQL table/database
# pd.read_table(filename) -> From a delimited text file(like TSV)
# pd.read_json(json_string) -> Reads from a json formatted string, URL or file
# pd.read_html(url) -> Parses an html URL, string or file and extracts tables to a list of dataframes
# pd.read_clipboard() -> Takes the contentes of your clipboard and passes it to read_table()
# pd.DataFrame(dict) -> From a dict, keys for columns names, values for data as lists

In [ ]:
#Exporting Data 
# df.to_csv(filename) -> Writes to a CSV file
# df.to_excel(filename) -> Writes on an Excel file
# df.to_sql(table_name, connection_object) -> Writes to a SQL table
# df.to_json(filename) -> Writes to a file in JSON format
# df.to_html(filename) -> Saves as an HTML table
# df.to_clipboard() -> Writes to the clipboard

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving kaggle.json to kaggle.json

In [ ]:
for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "kaggle.json" with length 69 bytes

In [ ]:
!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/
!chmod 600 ~/.kaggle/kaggle.json
!ls ~/.kaggle

kaggle.json

In [ ]:
!kaggle datasets download -d aaron7sun/stocknews

Downloading stocknews.zip to /content
  0% 0.00/5.82M [00:00<?, ?B/s]
100% 5.82M/5.82M [00:00<00:00, 53.5MB/s]

In [ ]:
!unzip \*.zip

Archive:  stocknews.zip
  inflating: Combined_News_DJIA.csv
  inflating: RedditNews.csv
  inflating: upload_DJIA_table.csv

In [ ]:
df = pd.read_csv('upload_DJIA_table.csv')
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.info() #This Code provides detailed information about our data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1989 entries, 0 to 1988
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1989 non-null   object
 1   Open       1989 non-null   float64
 2   High       1989 non-null   float64
 3   Low        1989 non-null   float64
 4   Close      1989 non-null   float64
 5   Volume     1989 non-null   int64
 6   Adj Close  1989 non-null   float64
dtypes: float64(5), int64(1), object(1)
memory usage: 108.9+ KB

In [ ]:
df.shape #This code shows us the number of rows and columns.

(1989, 7)

In [ ]:
df.index #This code shows the total number of index found

RangeIndex(start=0, stop=1989, step=1)

In [ ]:
df.columns #This code shows all the columns contained in the data we have examined.

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [ ]:
df.count() #This code shows us how many pieces of data are in each column.

Date         1989
Open         1989
High         1989
Low          1989
Close        1989
Volume       1989
Adj Close    1989
dtype: int64

In [ ]:
df.sum() #This code shows us the sum of the data in each column.

Date         2016-07-012016-06-302016-06-292016-06-282016-0...
Open                                               2.67702e+07
High                                               2.69337e+07
Low                                                2.65988e+07
Close                                               2.6778e+07
Volume                                            323831020000
Adj Close                                           2.6778e+07
dtype: object

In [ ]:
df.cumsum().head()#This code gives us cumulative sum of the data.

                                                Date  ...     Adj Close
0                                         2016-07-01  ...  17949.369141
1                               2016-07-012016-06-30  ...  35879.359375
2                     2016-07-012016-06-302016-06-29  ...  53574.039063
3           2016-07-012016-06-302016-06-292016-06-28  ...  70983.759766
4  2016-07-012016-06-302016-06-292016-06-282016-0...  ...  88124.000000

[5 rows x 7 columns]

In [ ]:
df.min() #This code brings us the smallest of the data.

Date         2008-08-08
Open            6547.01
High            6709.61
Low             6469.95
Close           6547.05
Volume          8410000
Adj Close       6547.05
dtype: object

In [ ]:
df.min() #This code brings us the smallest of the data.

Date         2008-08-08
Open            6547.01
High            6709.61
Low             6469.95
Close           6547.05
Volume          8410000
Adj Close       6547.05
dtype: object

In [ ]:
#idxmin(),This code fetches the smallest value in the data. The use on series and dataframe is different
print("df: ",df['Open'].idxmin())
print("series", mySeries.idxmin())

df:  1842
series b

In [ ]:
#idxmax(),This code returns the largest value in the data.
print("df: ",df['Open'].idxmax())
print("series: ",mySeries.idxmax())

df:  282
series:  c

In [ ]:
df.describe() #This Code provides basic statistical information about the data. The numerical column is based.

               Open          High  ...        Volume     Adj Close
count   1989.000000   1989.000000  ...  1.989000e+03   1989.000000
mean   13459.116048  13541.303173  ...  1.628110e+08  13463.032255
std     3143.281634   3136.271725  ...  9.392343e+07   3144.006996
min     6547.009766   6709.609863  ...  8.410000e+06   6547.049805
25%    10907.339844  11000.980469  ...  1.000000e+08  10913.379883
50%    13022.049805  13088.110352  ...  1.351700e+08  13025.580078
75%    16477.699219  16550.070312  ...  1.926000e+08  16478.410156
max    18315.060547  18351.359375  ...  6.749200e+08  18312.390625

[8 rows x 6 columns]

In [ ]:
df.mean() #This code returns the mean value for the numeric column.

Open         1.345912e+04
High         1.354130e+04
Low          1.337293e+04
Close        1.346303e+04
Volume       1.628110e+08
Adj Close    1.346303e+04
dtype: float64

In [ ]:
df.median() #This code returns median for columns with numeric values.

Open         1.302205e+04
High         1.308811e+04
Low          1.295313e+04
Close        1.302558e+04
Volume       1.351700e+08
Adj Close    1.302558e+04
dtype: float64

In [ ]:
df.quantile([0.25,0.75]) #This code calculates the values 0.25 and 0.75 of the columns for each column.

              Open          High  ...       Volume     Adj Close
0.25  10907.339844  11000.980469  ...  100000000.0  10913.379883
0.75  16477.699219  16550.070312  ...  192600000.0  16478.410156

[2 rows x 6 columns]

In [ ]:
df.var() #This code calculates the variance value for each column with a numeric value.

Open         9.880219e+06
High         9.836200e+06
Low          9.925152e+06
Close        9.884780e+06
Volume       8.821610e+15
Adj Close    9.884780e+06
dtype: float64

In [ ]:
df.std() #This code calculates the standard deviation value for each column with numeric value.

Open         3.143282e+03
High         3.136272e+03
Low          3.150421e+03
Close        3.144007e+03
Volume       9.392343e+07
Adj Close    3.144007e+03
dtype: float64

In [ ]:
df.cummax() #This code calculates the cumulative max value between the data.

            Date          Open  ...     Volume     Adj Close
0     2016-07-01  17924.240234  ...   82160000  17949.369141
1     2016-07-01  17924.240234  ...  133030000  17949.369141
2     2016-07-01  17924.240234  ...  133030000  17949.369141
3     2016-07-01  17924.240234  ...  133030000  17949.369141
4     2016-07-01  17924.240234  ...  138740000  17949.369141
...          ...           ...  ...        ...           ...
1984  2016-07-01  18315.060547  ...  674920000  18312.390625
1985  2016-07-01  18315.060547  ...  674920000  18312.390625
1986  2016-07-01  18315.060547  ...  674920000  18312.390625
1987  2016-07-01  18315.060547  ...  674920000  18312.390625
1988  2016-07-01  18315.060547  ...  674920000  18312.390625

[1989 rows x 7 columns]

In [ ]:
df.cummin() #This code returns the cumulative min value of the data.

            Date          Open  ...    Volume     Adj Close
0     2016-07-01  17924.240234  ...  82160000  17949.369141
1     2016-06-30  17712.759766  ...  82160000  17929.990234
2     2016-06-29  17456.019531  ...  82160000  17694.679688
3     2016-06-28  17190.509766  ...  82160000  17409.720703
4     2016-06-27  17190.509766  ...  82160000  17140.240234
...          ...           ...  ...       ...           ...
1984  2008-08-14   6547.009766  ...   8410000   6547.049805
1985  2008-08-13   6547.009766  ...   8410000   6547.049805
1986  2008-08-12   6547.009766  ...   8410000   6547.049805
1987  2008-08-11   6547.009766  ...   8410000   6547.049805
1988  2008-08-08   6547.009766  ...   8410000   6547.049805

[1989 rows x 7 columns]

In [ ]:
#df['columnName'].cumprod() ,This code returns the cumulative production of the data.
df['Open'].cumprod().head()

0    1.792424e+04
1    3.174878e+08
2    5.542073e+12
3    9.527105e+16
4    1.653449e+21
Name: Open, dtype: float64

In [ ]:
len(df) #This code gives you how many data there is.

1989

In [ ]:
df.isnull() #Checks for null values, returns boolean.

       Date   Open   High    Low  Close  Volume  Adj Close
0     False  False  False  False  False   False      False
1     False  False  False  False  False   False      False
2     False  False  False  False  False   False      False
3     False  False  False  False  False   False      False
4     False  False  False  False  False   False      False
...     ...    ...    ...    ...    ...     ...        ...
1984  False  False  False  False  False   False      False
1985  False  False  False  False  False   False      False
1986  False  False  False  False  False   False      False
1987  False  False  False  False  False   False      False
1988  False  False  False  False  False   False      False

[1989 rows x 7 columns]

In [ ]:
df.isnull().head()

    Date   Open   High    Low  Close  Volume  Adj Close
0  False  False  False  False  False   False      False
1  False  False  False  False  False   False      False
2  False  False  False  False  False   False      False
3  False  False  False  False  False   False      False
4  False  False  False  False  False   False      False

In [ ]:
df.corr() #it gives information about the correlation between the data.

               Open      High       Low     Close    Volume  Adj Close
Open       1.000000  0.999592  0.999436  0.998991 -0.691621   0.998991
High       0.999592  1.000000  0.999373  0.999546 -0.686997   0.999546
Low        0.999436  0.999373  1.000000  0.999595 -0.699572   0.999595
Close      0.998991  0.999546  0.999595  1.000000 -0.694281   1.000000
Volume    -0.691621 -0.686997 -0.699572 -0.694281  1.000000  -0.694281
Adj Close  0.998991  0.999546  0.999595  1.000000 -0.694281   1.000000

**Selection & Filtering**

In [ ]:
mySeries['b'] #This code returns data with a value of B in series.

-5

In [ ]:
#df[n:n] ,This code fetches data from N to N.
print(df[1982:])
print(df[5:7])

            Date          Open  ...     Volume     Adj Close
1982  2008-08-18  11659.650391  ...  156290000  11479.389648
1983  2008-08-15  11611.209961  ...  215040000  11659.900391
1984  2008-08-14  11532.070312  ...  159790000  11615.929688
1985  2008-08-13  11632.809570  ...  182550000  11532.959961
1986  2008-08-12  11781.700195  ...  173590000  11642.469727
1987  2008-08-11  11729.669922  ...  183190000  11782.349609
1988  2008-08-08  11432.089844  ...  212830000  11734.320312

[7 rows x 7 columns]
         Date          Open  ...     Volume     Adj Close
5  2016-06-24  17946.630859  ...  239000000  17400.750000
6  2016-06-23  17844.109375  ...   98070000  18011.070312

[2 rows x 7 columns]

In [ ]:
#df.iloc[[n],[n]] ,This code brings the data in the N row and N column in the DataFrame.
df.iloc[[0],[3]]

            Low
0  17916.910156

In [ ]:
#df.loc[n:n] ,This code allows us to fetch the data in the range we specify.
df.loc[5:7]

         Date          Open  ...     Volume     Adj Close
5  2016-06-24  17946.630859  ...  239000000  17400.750000
6  2016-06-23  17844.109375  ...   98070000  18011.070312
7  2016-06-22  17832.669922  ...   89440000  17780.830078

[3 rows x 7 columns]

In [ ]:
#df['columnName'] ,With this code, we can select and bring any column we want.
df['Open'].head()

0    17924.240234
1    17712.759766
2    17456.019531
3    17190.509766
4    17355.210938
Name: Open, dtype: float64

In [ ]:
#df['columnName'][n] ,With this code, we can select and return any value of the column we want.
df['Open'][0]

17924.240234

In [ ]:
#df['columnName'].nunique(),This code shows how many of the data that is in the selected column and does not repeat.
df['Open'].nunique()

1980

In [ ]:
#df['columnName'].unique(),This code shows which of the data in the selected column repeats.
df['Open'].unique()

array([17924.240234, 17712.759766, 17456.019531, ..., 11781.700195,
       11729.669922, 11432.089844])

In [ ]:
#df.columnName,This code is another way to select the column we want.
df.Open.head()

0    17924.240234
1    17712.759766
2    17456.019531
3    17190.509766
4    17355.210938
Name: Open, dtype: float64

In [ ]:
#df['columnName'].value_counts(dropna =False),This code counts all of the data in the column we have specified, but does not count the null/none values.
print(df.Open.value_counts(dropna =True).head())
#print(df['Item'].value_counts(dropna =False))

17374.779297    2
18033.330078    2
10309.389648    2
17711.119141    2
17812.250000    2
Name: Open, dtype: int64

In [ ]:
#df.head(n),This code optionally brings in the first 5 data. returns the number of data that you type instead of N.
df.head()
#df.head(15)

         Date          Open  ...     Volume     Adj Close
0  2016-07-01  17924.240234  ...   82160000  17949.369141
1  2016-06-30  17712.759766  ...  133030000  17929.990234
2  2016-06-29  17456.019531  ...  106380000  17694.679688
3  2016-06-28  17190.509766  ...  112190000  17409.720703
4  2016-06-27  17355.210938  ...  138740000  17140.240234

[5 rows x 7 columns]

In [ ]:
#df.tail(n) This code optionally brings 5 data at the end. returns the number of data that you type instead of N
df.tail()
#df.tail(20)

            Date          Open  ...     Volume     Adj Close
1984  2008-08-14  11532.070312  ...  159790000  11615.929688
1985  2008-08-13  11632.809570  ...  182550000  11532.959961
1986  2008-08-12  11781.700195  ...  173590000  11642.469727
1987  2008-08-11  11729.669922  ...  183190000  11782.349609
1988  2008-08-08  11432.089844  ...  212830000  11734.320312

[5 rows x 7 columns]

In [ ]:
#df.sample(n) This code fetches random n data from the data.
df.sample(5)

            Date          Open  ...     Volume     Adj Close
1636  2009-12-31  10548.509766  ...  137940000  10428.049805
357   2015-02-02  17169.990234  ...  108090000  17361.039062
65    2016-03-31  17716.050781  ...  102600000  17685.089844
1788  2009-05-27   8473.650391  ...  285990000   8300.019531
1068  2012-04-03  13258.959961  ...  123980000  13199.549805

[5 rows x 7 columns]

In [ ]:
#df.sample(frac=0.5) ,This code selects the fractions of random rows and fetches the data to that extent.
df.sample(frac=0.5).head()

            Date          Open  ...     Volume     Adj Close
1509  2010-07-06   9686.480469  ...  261020000   9743.620117
380   2014-12-29  18046.580078  ...   53870000  18038.230469
1633  2010-01-06  10564.719727  ...  186040000  10573.679688
839   2013-03-05  14127.820312  ...  112100000  14253.769531
919   2012-11-06  13112.900391  ...  105710000  13245.679688

[5 rows x 7 columns]

In [ ]:
#df.nlargest(n,'columnName') ,This code brings N from the column where we have specified the largest data.
df.nlargest(5,'Open')

           Date          Open  ...    Volume     Adj Close
282  2015-05-20  18315.060547  ...  80190000  18285.400391
283  2015-05-19  18300.480469  ...  87200000  18312.390625
280  2015-05-22  18286.869141  ...  78890000  18232.019531
281  2015-05-21  18285.869141  ...  84270000  18285.740234
337  2015-03-03  18281.949219  ...  83830000  18203.369141

[5 rows x 7 columns]

In [ ]:
#df.nsmallest(n,'columnName') ,This code brings N from the column where we have specified the smallest data.
df.nsmallest(3,'Open')

            Date         Open         High  ...        Close     Volume    Adj Close
1842  2009-03-10  6547.009766  6926.490234  ...  6926.490234  640020000  6926.490234
1844  2009-03-06  6595.160156  6755.169922  ...  6626.939941  425170000  6626.939941
1843  2009-03-09  6625.740234  6709.609863  ...  6547.049805  365990000  6547.049805

[3 rows x 7 columns]

In [ ]:
#df[df.columnName < 5] ,This code returns the column name we have specified, which is less than 5.
df[df.Open > 18281.949219]

           Date          Open  ...    Volume     Adj Close
280  2015-05-22  18286.869141  ...  78890000  18232.019531
281  2015-05-21  18285.869141  ...  84270000  18285.740234
282  2015-05-20  18315.060547  ...  80190000  18285.400391
283  2015-05-19  18300.480469  ...  87200000  18312.390625

[4 rows x 7 columns]

In [ ]:
#df[['columnName','columnName']] ,This code helps us pick and bring any columns we want.
df[['High','Low']].head()
# df.loc[:,["High","Low"]]

In [ ]:
#df.loc[:,"columnName1":"columnName2"] ,This code returns columns from columnname1 to columnname2.
df.loc[:,"Date":"Close"].head()
# data.loc[:3,"Date":"Close"]

         Date          Open          High           Low         Close
0  2016-07-01  17924.240234  18002.380859  17916.910156  17949.369141
1  2016-06-30  17712.759766  17930.609375  17711.800781  17929.990234
2  2016-06-29  17456.019531  17704.509766  17456.019531  17694.679688
3  2016-06-28  17190.509766  17409.720703  17190.509766  17409.720703
4  2016-06-27  17355.210938  17355.210938  17063.080078  17140.240234

In [ ]:
#Create Filter
filters = df.Date > '2016-06-27'
df[filters]

         Date          Open  ...     Volume     Adj Close
0  2016-07-01  17924.240234  ...   82160000  17949.369141
1  2016-06-30  17712.759766  ...  133030000  17929.990234
2  2016-06-29  17456.019531  ...  106380000  17694.679688
3  2016-06-28  17190.509766  ...  112190000  17409.720703

[4 rows x 7 columns]

In [ ]:
#df.filter(regex = 'code') ,This code allows regex to filter any data we want.
df.filter(regex='^L').head()

            Low
0  17916.910156
1  17711.800781
2  17456.019531
3  17190.509766
4  17063.080078

In [ ]:
#np.logical_and
df[np.logical_and(df['Open']>18281.949219, df['Date']>'2015-05-20' )]

           Date          Open  ...    Volume     Adj Close
280  2015-05-22  18286.869141  ...  78890000  18232.019531
281  2015-05-21  18285.869141  ...  84270000  18285.740234

[2 rows x 7 columns]

In [ ]:
#Filtering with &
df[(df['Open']>18281.949219) & (df['Date']>'2015-05-20')]

           Date          Open  ...    Volume     Adj Close
280  2015-05-22  18286.869141  ...  78890000  18232.019531
281  2015-05-21  18285.869141  ...  84270000  18285.740234

[2 rows x 7 columns]

**Sort Data**

In [ ]:
#df.sort_values('columnName'),This code sorts the column we specify in the form of low to high.
df.sort_values('Open').head()

            Date         Open         High  ...        Close     Volume    Adj Close
1842  2009-03-10  6547.009766  6926.490234  ...  6926.490234  640020000  6926.490234
1844  2009-03-06  6595.160156  6755.169922  ...  6626.939941  425170000  6626.939941
1843  2009-03-09  6625.740234  6709.609863  ...  6547.049805  365990000  6547.049805
1846  2009-03-04  6726.500000  6979.220215  ...  6875.839844  464830000  6875.839844
1847  2009-03-03  6764.810059  6855.290039  ...  6726.020020  445280000  6726.020020

[5 rows x 7 columns]

In [ ]:
#df.sort_values('columnName', ascending=False),This code is the column we specify in the form of high to low
df.sort_values('Date', ascending=False).head()

         Date          Open  ...     Volume     Adj Close
0  2016-07-01  17924.240234  ...   82160000  17949.369141
1  2016-06-30  17712.759766  ...  133030000  17929.990234
2  2016-06-29  17456.019531  ...  106380000  17694.679688
3  2016-06-28  17190.509766  ...  112190000  17409.720703
4  2016-06-27  17355.210938  ...  138740000  17140.240234

[5 rows x 7 columns]

In [ ]:
#df.sort_index() ,This code sorts from small to large according to the DataFrame index.
df.sort_index().head()

         Date          Open  ...     Volume     Adj Close
0  2016-07-01  17924.240234  ...   82160000  17949.369141
1  2016-06-30  17712.759766  ...  133030000  17929.990234
2  2016-06-29  17456.019531  ...  106380000  17694.679688
3  2016-06-28  17190.509766  ...  112190000  17409.720703
4  2016-06-27  17355.210938  ...  138740000  17140.240234

[5 rows x 7 columns]

**Rename & Defining New & Change Columns**

In [ ]:
#df.rename(columns= {'columnName' : 'newColumnName'}),This code helps us change the column name. 
df.rename(columns= {'Adj Close' : 'Adjclose'}).head()
# df = df.rename(columns= {'Id' : 'Identif'}, inplace=True) -> True way
# inplace= True or False; This meaning, overwrite the data set.
# Other Way
# df.columns = ['date', 'open', 'high', 'low', 'close', 'volume', 'adjclose']

         Date          Open  ...     Volume      Adjclose
0  2016-07-01  17924.240234  ...   82160000  17949.369141
1  2016-06-30  17712.759766  ...  133030000  17929.990234
2  2016-06-29  17456.019531  ...  106380000  17694.679688
3  2016-06-28  17190.509766  ...  112190000  17409.720703
4  2016-06-27  17355.210938  ...  138740000  17140.240234

[5 rows x 7 columns]

In [ ]:
#Defining New Column
df["Difference"] = df.High - df.Low
df.head()

         Date          Open          High  ...     Volume     Adj Close  Difference
0  2016-07-01  17924.240234  18002.380859  ...   82160000  17949.369141   85.470703
1  2016-06-30  17712.759766  17930.609375  ...  133030000  17929.990234  218.808594
2  2016-06-29  17456.019531  17704.509766  ...  106380000  17694.679688  248.490235
3  2016-06-28  17190.509766  17409.720703  ...  112190000  17409.720703  219.210937
4  2016-06-27  17355.210938  17355.210938  ...  138740000  17140.240234  292.130860

[5 rows x 8 columns]

In [ ]:
#Change Index Name,Change index name to new index name
print(df.index.name)
df.index.name = "index_name"
df.head()

None

                  Date          Open  ...     Adj Close  Difference
index_name                            ...
0           2016-07-01  17924.240234  ...  17949.369141   85.470703
1           2016-06-30  17712.759766  ...  17929.990234  218.808594
2           2016-06-29  17456.019531  ...  17694.679688  248.490235
3           2016-06-28  17190.509766  ...  17409.720703  219.210937
4           2016-06-27  17355.210938  ...  17140.240234  292.130860

[5 rows x 8 columns]

In [ ]:
#Make all columns lowercase
#df.columns = map(str.lower(), df.columns)
#Make all columns uppercase
#df.columns = map(str.upper(), df.columns)

In [ ]:
#Drop Data,df.drop(columns=['columnName']) This code deletes the column we have specified
df.drop(columns=['Adj Close']).head()
# df = df.drop(columns=['Id']) -> True way
# OR
# df = df.drop('col', axis=1)
# axis = 1 is meaning delete columns
# axis = 0 is meaning delete rows

                  Date          Open  ...     Volume  Difference
index_name                            ...
0           2016-07-01  17924.240234  ...   82160000   85.470703
1           2016-06-30  17712.759766  ...  133030000  218.808594
2           2016-06-29  17456.019531  ...  106380000  248.490235
3           2016-06-28  17190.509766  ...  112190000  219.210937
4           2016-06-27  17355.210938  ...  138740000  292.130860

[5 rows x 7 columns]

In [ ]:
mySeries.drop(['a']),#This code allows us to delete the value specified in the series.

(b   -5
 c    7
 d    4
 dtype: int64,)

In [ ]:
#Drop an observation (row)
# df.drop(['2016-07-01', '2016-06-27'])

In [ ]:
#Drop a variable (column), axis=1 denotes that we are referring to a column, not a row
#df.drop('Volume', axis=1)

In [ ]:
#Convert Data Types 
#df.dtypes ,This code shows what data type of columns are. Boolean, int, float, object(String), date and categorical.
df.dtypes

Date           object
Open          float64
High          float64
Low           float64
Close         float64
Volume          int64
Adj Close     float64
Difference    float64
dtype: object

In [ ]:
#df['columnName'] = df['columnName'].astype('dataType'),This code convert the column we specify into the data type we specify.
df.Date.astype('category').dtypes
# OR Convert Datetime
# df.Date= pd.to_datetime(df.Date)

CategoricalDtype(categories=['2008-08-08', '2008-08-11', '2008-08-12', '2008-08-13',
                  '2008-08-14', '2008-08-15', '2008-08-18', '2008-08-19',
                  '2008-08-20', '2008-08-21',
                  ...
                  '2016-06-20', '2016-06-21', '2016-06-22', '2016-06-23',
                  '2016-06-24', '2016-06-27', '2016-06-28', '2016-06-29',
                  '2016-06-30', '2016-07-01'],
                 ordered=False)

In [ ]:
#pd.melt(frame=dataFrameName,id_vars = 'columnName', value_vars= ['columnName'])
df_new = df.head()
melted = pd.melt(frame=df_new,id_vars = 'Date', value_vars= ['Low'])
melted

         Date variable         value
0  2016-07-01      Low  17916.910156
1  2016-06-30      Low  17711.800781
2  2016-06-29      Low  17456.019531
3  2016-06-28      Low  17190.509766
4  2016-06-27      Low  17063.080078

In [ ]:
#Apply Function
#Method 1 
def examples(x):   #create a function
    return x*2

df.Open.apply(examples).head()  #use the function with apply() 

#Method 2
df.Open.apply(lambda x: x*2).head()

index_name
0    35848.480468
1    35425.519532
2    34912.039062
3    34381.019532
4    34710.421876
Name: Open, dtype: float64

In [ ]:
#DataFrame.cov,Compute pairwise covariance of columns, excluding NA/null values.
import pandas as pd
df = pd.DataFrame([(1, 2), (0, 3), (2, 0), (1, 1)],
                  columns=['dogs', 'cats'])
df.cov()

          dogs      cats
dogs  0.666667 -1.000000
cats -1.000000  1.666667

In [ ]:
#DataFrame.count,Count non-NA cells for each column or row.
import numpy as np
df = pd.DataFrame({"Person":
                   ["John", "Myla", "Lewis", "John", "Myla"],
                   "Age": [24., np.nan, 21., 33, 26],
                   "Single": [False, True, True, True, False]})
df
df.count()
print(df.count(axis='columns'))

0    3
1    2
2    3
3    3
4    3
dtype: int64

In [ ]:
#Merging or joining on the basis of common variable.
students = pd.DataFrame({'Names': ['John','Mary','Henry','Augustus','Kenny'],
                         'Zodiac Signs': ['Aquarius','Libra','Gemini','Pisces','Virgo']})
students2 = pd.DataFrame({'Names': ['John','Mary','Henry','Augustus','Kenny'],
                          'Marks' : [50,81,98,25,35]})
#pd.merge we can join the two dataframes. on = 'Names' denotes the common variable on the basis of which the dataframes are to be combined is 'Names'
result = pd.merge(students, students2, on='Names')  #it only takes intersections
result  #By default how = "inner" thus it takes only the common elements in both the dataframes

      Names Zodiac Signs  Marks
0      John     Aquarius     50
1      Mary        Libra     81
2     Henry       Gemini     98
3  Augustus       Pisces     25
4     Kenny        Virgo     35

In [ ]:
#If you want all the elements in both the dataframes set how = "outer"
result = pd.merge(students, students2, on='Names',how = "outer")  #it only takes unions
result

      Names Zodiac Signs  Marks
0      John     Aquarius     50
1      Mary        Libra     81
2     Henry       Gemini     98
3  Augustus       Pisces     25
4     Kenny        Virgo     35

In [ ]:
#To take only intersections and all the values in left df set how = 'left'
result = pd.merge(students, students2, on='Names',how = "left")
result

      Names Zodiac Signs  Marks
0      John     Aquarius     50
1      Mary        Libra     81
2     Henry       Gemini     98
3  Augustus       Pisces     25
4     Kenny        Virgo     35

In [ ]:
#Similarly how = 'right' takes only intersections and all the values in right df.
result = pd.merge(students, students2, on='Names',how = "right",indicator = True)
result
#indicator = True creates a column for indicating that whether the values are present in both the dataframes or either left or right dataframe.

      Names Zodiac Signs  Marks _merge
0      John     Aquarius     50   both
1      Mary        Libra     81   both
2     Henry       Gemini     98   both
3  Augustus       Pisces     25   both
4     Kenny        Virgo     35   both

In [ ]:
#Concatenating,pd.concat( ) function we can join the 2 dataframes
students = pd.DataFrame({'Names': ['John','Mary','Henry','Augustus','Kenny'],
                         'Zodiac Signs': ['Aquarius','Libra','Gemini','Pisces','Virgo']})
students2 = pd.DataFrame({'Names': ['John','Mary','Henry','Augustus','Kenny'],
                          'Marks' : [50,81,98,25,35]})
data = pd.concat([students,students2])  #by default axis = 0
#By default axis = 0 thus the new dataframe will be added row-wise. 
#If a column is not present then in one of the dataframes it creates NaNs. To join column wise we set axis = 1

data = pd.concat([students,students2],axis = 1)
data

      Names Zodiac Signs     Names  Marks
0      John     Aquarius      John     50
1      Mary        Libra      Mary     81
2     Henry       Gemini     Henry     98
3  Augustus       Pisces  Augustus     25
4     Kenny        Virgo     Kenny     35

In [ ]:
#Using append function we can join the dataframes row-wise
students.append(students2)  #for rows

      Names Zodiac Signs  Marks
0      John     Aquarius    NaN
1      Mary        Libra    NaN
2     Henry       Gemini    NaN
3  Augustus       Pisces    NaN
4     Kenny        Virgo    NaN
0      John          NaN   50.0
1      Mary          NaN   81.0
2     Henry          NaN   98.0
3  Augustus          NaN   25.0
4     Kenny          NaN   35.0

In [ ]:
#create a dictionary of the two data frames and can use pd.concat to join the dataframes row wise
classes = {'x': students, 'y': students2}
result = pd.concat(classes)
result

        Names Zodiac Signs  Marks
x 0      John     Aquarius    NaN
  1      Mary        Libra    NaN
  2     Henry       Gemini    NaN
  3  Augustus       Pisces    NaN
  4     Kenny        Virgo    NaN
y 0      John          NaN   50.0
  1      Mary          NaN   81.0
  2     Henry          NaN   98.0
  3  Augustus          NaN   25.0
  4     Kenny          NaN   35.0

In [ ]:
#Select numeric or categorical columns only
#To include numeric columns we use select_dtypes( ) 
data1 = iris.select_dtypes(include=[np.number])
data1.head()
#_get_numeric_data also provides utility to select the numeric columns only.
data3 = iris._get_numeric_data()
data3.head(3)
#For selecting categorical variables
data4 = iris.select_dtypes(include = ['object'])
data4.head(2)

In [ ]:
#Calculating the percentiles
#Various quantiles can be obtained by using quantile( )
iris.quantile(0.5)
iris.quantile([0.1,0.2,0.5])
iris.quantile(0.55)

In [ ]:
#Cumulative sum by a variable
#To find the cumulative sum of sepal lengths for different species we use groupby( ) and then use cumsum( )
iris["cumsum2"] = iris.groupby(["Species"])["Sepal.Length"].cumsum()
iris.head()

In [ ]:
#Ranking
# To create a dataframe of all the ranks we use rank( )
iris.rank() 
#Ranking by a specific variable,Suppose we want to rank the Sepal.Length for different species in ascending order:
iris['Rank2'] = iris['Sepal.Length'].groupby(iris["Species"]).rank(ascending=1)
iris.head()

In [ ]:
#Creating dummies
#map( ) function is used to match the values and replace them in the new series automatically created.
iris["setosa"] = iris.Species.map({"setosa" : 1,"versicolor":0, "virginica" : 0})
iris.head()
#To create dummies get_dummies( ) is used. iris.Species.prefix = "Species" adds a prefix ' Species' to the new series created.
pd.get_dummies(iris.Species,prefix = "Species")
pd.get_dummies(iris.Species,prefix = "Species").iloc[:,0:1]  #1 is not included
species_dummies = pd.get_dummies(iris.Species,prefix = "Species").iloc[:,0:]

In [ ]:
#Dealing with duplicates
data = pd.DataFrame({"Items" : ["TV","Washing Machine","Mobile","TV","TV","Washing Machine"], "Price" : [10000,50000,20000,10000,10000,40000]})
print(data)
#duplicated() returns a logical vector returning True when encounters duplicated
data.loc[data.duplicated(),:]
data.loc[data.duplicated(keep = "first"),:]
#By default keep = 'first' i.e. the first occurence is considered a unique value and its repetitions are considered as duplicates.
#keep = "last" the last occurence is considered a unique value and all its repetitions are considered as duplicates.
data.loc[data.duplicated(keep = "last"),:] #last entries are not there,indices have changed.
#If keep = "False" then it considers all the occurences of the repeated observations as duplicates.
data.loc[data.duplicated(keep = False),:]  #all the duplicates, including unique are shown.

#To drop the duplicates drop_duplicates is used with default inplace = False, keep = 'first' or 'last' or 'False' have the respective meanings as in duplicated( )
data.drop_duplicates(keep = "first")
data.drop_duplicates(keep = "last")
data.drop_duplicates(keep = False,inplace = True)  #by default inplace = False
data

             Items  Price
0               TV  10000
1  Washing Machine  50000
2           Mobile  20000
3               TV  10000
4               TV  10000
5  Washing Machine  40000

  Items  Price
3    TV  10000
4    TV  10000

In [ ]:
#Dealing with missing values
import numpy as np
mydata = {'Crop': ['Rice', 'Wheat', 'Barley', 'Maize'],
        'Yield': [1010, 1025.2, 1404.2, 1251.7],
        'cost' : [102, np.nan, 20, 68]}
crops = pd.DataFrame(mydata)
print(crops)

#isnull( ) returns True and notnull( ) returns False if the value is NaN.
print(crops.isnull() ) #same as is.na in R
print(crops.notnull())  #opposite of previous command.
print(crops.isnull().sum())  #No. of missing values.

#To drop all the rows which have missing values in any rows we use dropna(how = "any") .
# By default inplace = False . If how = "all" means drop a row if all the elements in that row are missing
print(crops.dropna(how = "any").shape)
print(crops.dropna(how = "all").shape  )


#To remove NaNs if any of 'Yield' or'cost' are missing we use the subset parameter and pass a list:
print(crops.dropna(subset = ['Yield',"cost"],how = 'any').shape)
print(crops.dropna(subset = ['Yield',"cost"],how = 'all').shape)

#Replacing the missing values by "UNKNOWN" sub attribute in Column name.
crops['cost'].fillna(value = "UNKNOWN",inplace = True)
print(crops)

     Crop   Yield   cost
0    Rice  1010.0  102.0
1   Wheat  1025.2    NaN
2  Barley  1404.2   20.0
3   Maize  1251.7   68.0
    Crop  Yield   cost
0  False  False  False
1  False  False   True
2  False  False  False
3  False  False  False
   Crop  Yield   cost
0  True   True   True
1  True   True  False
2  True   True   True
3  True   True   True
Crop     0
Yield    0
cost     1
dtype: int64
(3, 3)
(4, 3)
(3, 3)
(4, 3)
     Crop   Yield     cost
0    Rice  1010.0      102
1   Wheat  1025.2  UNKNOWN
2  Barley  1404.2       20
3   Maize  1251.7       68

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving income.csv to income.csv

In [ ]:
import pandas as pd
import numpy as np
income = pd.read_csv("income.csv")

In [ ]:
#Extract Unique Values
#The unique() function shows the unique levels or categories in the dataset.
print(income.Index.unique())
#The nunique( ) shows the number of unique values.
print(income.Index.nunique())

['A' 'C' 'D' 'F' 'G' 'H' 'I' 'K' 'L' 'M' 'N' 'O' 'P' 'R' 'S' 'T' 'U' 'V'
 'W']
19

In [ ]:
#Generate Cross Tab
#pd.crosstab( ) is used to create a bivariate frequency distribution. Here the bivariate frequency distribution is between Index and State columns.
pd.crosstab(income.Index,income.State)

State  Alabama  Alaska  Arizona  ...  West Virginia  Wisconsin  Wyoming
Index                            ...
A            1       1        1  ...              0          0        0
C            0       0        0  ...              0          0        0
D            0       0        0  ...              0          0        0
F            0       0        0  ...              0          0        0
G            0       0        0  ...              0          0        0
H            0       0        0  ...              0          0        0
I            0       0        0  ...              0          0        0
K            0       0        0  ...              0          0        0
L            0       0        0  ...              0          0        0
M            0       0        0  ...              0          0        0
N            0       0        0  ...              0          0        0
O            0       0        0  ...              0          0        0
P            0       0        0  ...              0          0        0
R            0       0        0  ...              0          0        0
S            0       0        0  ...              0          0        0
T            0       0        0  ...              0          0        0
U            0       0        0  ...              0          0        0
V            0       0        0  ...              0          0        0
W            0       0        0  ...              1          1        1

[19 rows x 51 columns]

In [ ]:
#Creating a frequency distribution
#income.Index selects the 'Index' column of 'income' dataset and value_counts( ) creates a frequency distribution. By default ascending = False i.e. it will show the 'Index' having the maximum frequency on the top.
income.Index.value_counts(ascending = True)

F    1
H    1
U    1
L    1
G    1
P    1
R    1
S    2
D    2
K    2
V    2
T    2
O    3
C    3
A    4
I    4
W    4
N    8
M    8
Name: Index, dtype: int64

In [ ]:
#To draw the samples
#income.sample( ) is used to draw random samples from the dataset containing all the columns
print(income.sample(n = 5))
print(income.sample(frac = 0.1))

   Index      State    Y2002    Y2003  ...    Y2012    Y2013    Y2014    Y2015
12     I      Idaho  1353210  1438538  ...  1643855  1312561  1713718  1757171
17     K   Kentucky  1813878  1448846  ...  1916616  1878271  1722762  1913350
25     M   Missouri  1221316  1858368  ...  1800052  1698105  1767835  1996005
49     W  Wisconsin  1788920  1518578  ...  1729177  1510119  1701650  1846238
43     T      Texas  1520591  1310777  ...  1882532  1698698  1646508  1705322

[5 rows x 16 columns]
   Index       State    Y2002    Y2003  ...    Y2012    Y2013    Y2014    Y2015
26     M     Montana  1877154  1540099  ...  1185225  1465705  1110394  1125903
0      A     Alabama  1296530  1317711  ...  1186741  1852841  1558906  1916661
12     I       Idaho  1353210  1438538  ...  1643855  1312561  1713718  1757171
47     W  Washington  1977749  1687136  ...  1775787  1273834  1387428  1377341
7      D    Delaware  1330403  1268673  ...  1984027  1671279  1803169  1627508

[5 rows x 16 columns]

In [ ]:
#Selecting only a few of the columns
income["State"]
income.State
#To select multiple columns by name, you can use the following syntax.
income[["Index","State","Y2008"]].head()

  Index       State    Y2008
0     A     Alabama  1945229
1     A      Alaska  1551826
2     A     Arizona  1752886
3     A    Arkansas  1188104
4     C  California  1487315

In [ ]:
#To select only specific columns and rows, we use either loc[ ] or iloc[ ] functions.
#Syntax of df.loc[  ],df.loc[row_index , column_index]
print(income.loc[:,["Index","State","Y2008"]])
print(income.loc[0:2,["Index","State","Y2008"]])  #Selecting rows with Index label 0 to 2 & columns
print(income.loc[:,"Index":"Y2008"] ) #Selecting consecutive columns
#In the above command both Index and Y2008 are included.
print(income.iloc[:,0:5] ) #Columns from 1 to 5 are included. 6th column not included

   Index                 State    Y2008
0      A               Alabama  1945229
1      A                Alaska  1551826
2      A               Arizona  1752886
3      A              Arkansas  1188104
4      C            California  1487315
5      C              Colorado  1875146
6      C           Connecticut  1764457
7      D              Delaware  1762096
8      D  District of Columbia  1193245
9      F               Florida  1756185
10     G               Georgia  1773090
11     H                Hawaii  1919423
12     I                 Idaho  1335481
13     I              Illinois  1871645
14     I               Indiana  1139551
15     I                  Iowa  1317983
16     K                Kansas  1949478
17     K              Kentucky  1301848
18     L             Louisiana  1185085
19     M                 Maine  1295877
20     M              Maryland  1112765
21     M         Massachusetts  1978904
22     M              Michigan  1990431
23     M             Minnesota  1328133
24     M           Mississippi  1428291
25     M              Missouri  1735099
26     M               Montana  1251742
27     N              Nebraska  1140598
28     N                Nevada  1903270
29     N         New Hampshire  1762936
30     N            New Jersey  1568034
31     N            New Mexico  1237704
32     N              New York  1732098
33     N        North Carolina  1267737
34     N          North Dakota  1720352
35     O                  Ohio  1516621
36     O              Oklahoma  1256746
37     O                Oregon  1482786
38     P          Pennsylvania  1274168
39     R          Rhode Island  1151409
40     S        South Carolina  1250499
41     S          South Dakota  1171870
42     T             Tennessee  1826406
43     T                 Texas  1785986
44     U                  Utah  1939284
45     V               Vermont  1123567
46     V              Virginia  1803330
47     W            Washington  1545621
48     W         West Virginia  1238174
49     W             Wisconsin  1980167
50     W               Wyoming  1587602
  Index    State    Y2008
0     A  Alabama  1945229
1     A   Alaska  1551826
2     A  Arizona  1752886
   Index                 State    Y2002  ...    Y2006    Y2007    Y2008
0      A               Alabama  1296530  ...  1107408  1440134  1945229
1      A                Alaska  1170302  ...  1861639  1465841  1551826
2      A               Arizona  1742027  ...  1102568  1109382  1752886
3      A              Arkansas  1485531  ...  1669191  1801213  1188104
4      C            California  1685349  ...  1735069  1812546  1487315
5      C              Colorado  1343824  ...  1871471  1814218  1875146
6      C           Connecticut  1610512  ...  1841266  1976976  1764457
7      D              Delaware  1330403  ...  1441351  1300836  1762096
8      D  District of Columbia  1111437  ...  1803852  1595981  1193245
9      F               Florida  1964626  ...  1339608  1278550  1756185
10     G               Georgia  1929009  ...  1326846  1223770  1773090
11     H                Hawaii  1461570  ...  1459383  1430465  1919423
12     I                 Idaho  1353210  ...  1122387  1772050  1335481
13     I              Illinois  1508356  ...  1540274  1747614  1871645
14     I               Indiana  1776918  ...  1848073  1129546  1139551
15     I                  Iowa  1499269  ...  1554813  1452911  1317983
16     K                Kansas  1509054  ...  1104256  1863278  1949478
17     K              Kentucky  1813878  ...  1137913  1911227  1301848
18     L             Louisiana  1584734  ...  1233709  1920301  1185085
19     M                 Maine  1582720  ...  1438549  1330014  1295877
20     M              Maryland  1579713  ...  1310270  1789128  1112765
21     M         Massachusetts  1647582  ...  1531641  1380529  1978904
22     M              Michigan  1295635  ...  1729449  1567494  1990431
23     M             Minnesota  1729921  ...  1985692  1148621  1328133
24     M           Mississippi  1983285  ...  1354579  1731643  1428291
25     M              Missouri  1221316  ...  1374863  1486197  1735099
26     M               Montana  1877154  ...  1625721  1983568  1251742
27     N              Nebraska  1885081  ...  1500594  1278272  1140598
28     N                Nevada  1426117  ...  1694526  1765826  1903270
29     N         New Hampshire  1419776  ...  1645430  1286967  1762936
30     N            New Jersey  1605532  ...  1541327  1156804  1568034
31     N            New Mexico  1819239  ...  1723493  1475985  1237704
32     N              New York  1395149  ...  1426941  1463171  1732098
33     N        North Carolina  1616742  ...  1158716  1827420  1267737
34     N          North Dakota  1618807  ...  1425030  1868788  1720352
35     O                  Ohio  1802132  ...  1534888  1314824  1516621
36     O              Oklahoma  1173918  ...  1312574  1708245  1256746
37     O                Oregon  1794912  ...  1502242  1419251  1482786
38     P          Pennsylvania  1320191  ...  1971479  1563062  1274168
39     R          Rhode Island  1501744  ...  1835983  1234040  1151409
40     S        South Carolina  1631522  ...  1538731  1825195  1250499
41     S          South Dakota  1159037  ...  1418586  1279134  1171870
42     T             Tennessee  1811867  ...  1786132  1399191  1826406
43     T                 Texas  1520591  ...  1873544  1655483  1785986
44     U                  Utah  1771096  ...  1437456  1859416  1939284
45     V               Vermont  1146902  ...  1332048  1563537  1123567
46     V              Virginia  1134317  ...  1708715  1197698  1803330
47     W            Washington  1977749  ...  1334864  1621989  1545621
48     W         West Virginia  1677347  ...  1922085  1740826  1238174
49     W             Wisconsin  1788920  ...  1251678  1721874  1980167
50     W               Wyoming  1775190  ...  1750527  1523124  1587602

[51 rows x 9 columns]
   Index                 State    Y2002    Y2003    Y2004
0      A               Alabama  1296530  1317711  1118631
1      A                Alaska  1170302  1960378  1818085
2      A               Arizona  1742027  1968140  1377583
3      A              Arkansas  1485531  1994927  1119299
4      C            California  1685349  1675807  1889570
5      C              Colorado  1343824  1878473  1886149
6      C           Connecticut  1610512  1232844  1181949
7      D              Delaware  1330403  1268673  1706751
8      D  District of Columbia  1111437  1993741  1374643
9      F               Florida  1964626  1468852  1419738
10     G               Georgia  1929009  1541565  1810773
11     H                Hawaii  1461570  1200280  1213993
12     I                 Idaho  1353210  1438538  1739154
13     I              Illinois  1508356  1527440  1493029
14     I               Indiana  1776918  1734104  1269927
15     I                  Iowa  1499269  1444576  1576367
16     K                Kansas  1509054  1290700  1522230
17     K              Kentucky  1813878  1448846  1800760
18     L             Louisiana  1584734  1110625  1868456
19     M                 Maine  1582720  1678622  1208496
20     M              Maryland  1579713  1404700  1849798
21     M         Massachusetts  1647582  1686259  1620601
22     M              Michigan  1295635  1149931  1601027
23     M             Minnesota  1729921  1675204  1903907
24     M           Mississippi  1983285  1292558  1631325
25     M              Missouri  1221316  1858368  1773451
26     M               Montana  1877154  1540099  1332722
27     N              Nebraska  1885081  1309769  1425527
28     N                Nevada  1426117  1114500  1119707
29     N         New Hampshire  1419776  1854370  1195119
30     N            New Jersey  1605532  1141514  1613550
31     N            New Mexico  1819239  1226057  1935991
32     N              New York  1395149  1611371  1170675
33     N        North Carolina  1616742  1292223  1482792
34     N          North Dakota  1618807  1510193  1876940
35     O                  Ohio  1802132  1648498  1441386
36     O              Oklahoma  1173918  1334639  1663622
37     O                Oregon  1794912  1726665  1805445
38     P          Pennsylvania  1320191  1446723  1218591
39     R          Rhode Island  1501744  1942942  1266657
40     S        South Carolina  1631522  1803455  1425193
41     S          South Dakota  1159037  1150689  1660148
42     T             Tennessee  1811867  1485909  1974179
43     T                 Texas  1520591  1310777  1957713
44     U                  Utah  1771096  1195861  1979395
45     V               Vermont  1146902  1832249  1492704
46     V              Virginia  1134317  1163996  1891068
47     W            Washington  1977749  1687136  1199490
48     W         West Virginia  1677347  1380662  1176100
49     W             Wisconsin  1788920  1518578  1289663
50     W               Wyoming  1775190  1498098  1198212

In [ ]:
#Difference between loc and iloc
#loc considers rows (or columns) with particular labels from the index.
# Whereas iloc considers rows (or columns) at particular positions in the index so it only takes integers.
x = pd.DataFrame({"var1" : np.arange(1,20,2)}, index=[9,8,7,6,10, 1, 2, 3, 4, 5])
print(x)
print(x.iloc[:3])
print(x.loc[:3])

    var1
9      1
8      3
7      5
6      7
10     9
1     11
2     13
3     15
4     17
5     19
   var1
9     1
8     3
7     5
    var1
9      1
8      3
7      5
6      7
10     9
1     11
2     13
3     15

In [ ]:
#Renaming the variables
data = pd.DataFrame({"A" : ["John","Mary","Julia","Kenny","Henry"], "B" : ["Libra","Capricorn","Aries","Scorpio","Aquarius"]})
data 
#Renaming all the variables.
data.columns = ['Names','Zodiac Signs']
#Renaming only some of the variables.
data.rename(columns = {"Names":"Cust_Name"},inplace = True) 
#By default in pandas inplace = False which means that no changes are made in the original dataset.
#Thus if we wish to alter the original dataset we need to define inplace = True.

In [ ]:
#we want to replace only a particular character in the list of the column names then we can use str.replace( ) function
income.columns = income.columns.str.replace('Y' , 'Year ')
income.columns

Index(['Index', 'State', 'Year 2002', 'Year 2003', 'Year 2004', 'Year 2005',
       'Year 2006', 'Year 2007', 'Year 2008', 'Year 2009', 'Year 2010',
       'Year 2011', 'Year 2012', 'Year 2013', 'Year 2014', 'Year 2015'],
      dtype='object')

In [ ]:
#Setting one column in the data frame as the index
income.set_index("Index",inplace = True)
income.head()
#Note that the indices have changed and Index column is now no more a column
income.columns
income.reset_index(inplace = True)
income.head()

  Index       State  Year 2002  ...  Year 2013  Year 2014  Year 2015
0     A     Alabama    1296530  ...    1852841    1558906    1916661
1     A      Alaska    1170302  ...    1985302    1580394    1979143
2     A     Arizona    1742027  ...    1363279    1525866    1647724
3     A    Arkansas    1485531  ...    1591896    1360959    1329341
4     C  California    1685349  ...    1156536    1388461    1644607

[5 rows x 16 columns]

In [ ]:
#Removing columns and rows
#To drop a column we use drop( ) where the first argument is a list of columns to be removed.
#By default axis = 0 which means the operation should take place horizontally, row wise. To remove a column we need to set axis = 1.
income.drop('Index',axis = 1)

#Alternatively
income.drop("Index",axis = "columns")
income.drop(['Index','State'],axis = 1)
income.drop(0,axis = 0)
income.drop(0,axis = "index")
income.drop([0,1,2,3],axis = 0)
#Also inplace = False by default thus no alterations are made in the original dataset.  axis = "columns"  and axis = "index" means the column and row(index) should be removed respectively.

In [ ]:
#Sorting Data
#To sort the data sort_values( ) function is deployed. By default inplace = False and ascending = True.
income.sort_values("State",ascending = False)
income.sort_values("State",ascending = False,inplace = True)
income.Y2006.sort_values() 
income.sort_values(["Index","Y2002"])

In [ ]:
#Create new variables
#Using eval( ) arithmetic operations on various columns can be carried out in a dataset
income["difference2"] = income.eval("Y2008 - Y2009")
income.head()
#We can also use assign( ) function but this command does not make changes in the original data as there is no inplace parameter. Hence we need to save it in a new dataset.
data = income.assign(ratio = (income.Y2008 / income.Y2009))
data.head()

In [ ]:
#Finding Descriptive Statistics
#describe( ) is used to find some statistics like mean,minimum, quartiles etc. for numeric variables.
income.describe() #for numeric variables
#For character or string variables, you can write include = ['object'].
# It will return total count, maximum occurring string and its frequency
income.describe(include = ['object'])  #Only for strings / objects
#To find out specific descriptive statistics of each column of data frame
income.mean()
income.median()
income.agg(["mean","median"])#agg( ) performs aggregation with summary functions like sum, mean, median, min, max etc.

How to run functions for a particular column(s)?
income.Y2008.mean()
income.Y2008.median()
income.Y2008.min()
income.loc[:,["Y2002","Y2008"]].max()

In [ ]:
#GroupBy function
#To group the data by a categorical variable we use groupby( ) function and hence we can do the operations on each category.
income.groupby("Index")["Y2002","Y2003"].min()

#To run multiple summary functions, we can use agg( ) function which is used to aggregate the data
income.groupby("Index")["Y2002","Y2003"].agg(["min","max","mean"])

#The following command finds minimum and maximum values for Y2002 and only mean for Y2003
income.groupby("Index").agg({"Y2002": ["min","max"],"Y2003" : "mean"})

#Groupby more than 1 column
income.groupby(["Index", "State"]).agg({"Y2002": ["min","max"],"Y2003" : "mean"})

#By default, option as_index=True is enabled in groupby which means the columns you use in groupby will become an index in the new dataframe. To disable it, you can make it False which stores the variables you use in groupby in different columns in the new dataframe.
dt = income.groupby(["Index","State"], as_index=False)["Y2002","Y2003"].min()